In [1]:
import pandas as pd

In [3]:
dataFrame = pd.read_excel("maas.xlsx") # excel'i okumak

In [4]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0      Ahmet   100  25.0    Yazılım
1     Mehmet   200  40.0      Satış
2       Ayse   150  35.0        NaN
3      Fatma   300  50.0  Pazarlama
4      Osman    50   NaN     Finans
5        Ali   350  30.0      Hukuk

In [6]:
fullDataFrame = dataFrame.dropna() # nan olan satırları silecek

In [7]:
fullDataFrame

  Unnamed: 0  Maas   Yas  Departman
0      Ahmet   100  25.0    Yazılım
1     Mehmet   200  40.0      Satış
3      Fatma   300  50.0  Pazarlama
5        Ali   350  30.0      Hukuk

In [8]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0      Ahmet   100  25.0    Yazılım
1     Mehmet   200  40.0      Satış
2       Ayse   150  35.0        NaN
3      Fatma   300  50.0  Pazarlama
4      Osman    50   NaN     Finans
5        Ali   350  30.0      Hukuk

In [9]:
fullDataFrame.to_excel("yenimaas.xlsx") # excel'e yazmak için

In [10]:
## uzantısı csv olan dosyalar için;
### read_csv
### to_csv methodlarını kullanırız